name: "ZF-512"

input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 224
  dim: 224
}

input: "im_info"
input_shape {
  dim: 1
  dim: 3
}
layer {
    name: "conv1_dw"
    type: "DepthwiseConvolution"
    bottom: "data"
    top: "conv1_dw"
    param {lr_mult: 1.0}
    param {lr_mult: 2.0}
    convolution_param {
      num_output: 3
      pad: 4
      kernel_size: 7
      stride: 4
      group: 3
    }
}
layer {
    name: "relu1_dw"
    type: "ReLU"
    bottom: "conv1_dw"
    top: "conv1_dw"
}
layer {
    name: "norm1_dw"
    type: "BatchNorm"
    bottom: "conv1_dw"
    top: "conv1_dw"
    batch_norm_param {use_global_stats: true}
}
layer {
    name: "scale1_dw"
    type: "Scale"
    bottom: "conv1_dw"
    top: "conv1_dw"
    param {lr_mult: 1.0}
    param {lr_mult: 2.0}
    scale_param {bias_term: true}
}
layer {
    name: "conv1_1x1"
    type: "Convolution"
    bottom: "conv1_dw"
    top: "conv1_1x1"
    param {lr_mult: 1.0}
    param {lr_mult: 2.0}
    convolution_param {
      num_output: 48
      pad: 0
      kernel_size: 1
      stride: 1

    }
}
layer {
    name: "relu1_1x1"
    type: "ReLU"
    bottom: "conv1_1x1"
    top: "conv1_1x1"
}
layer {
    name: "norm1_1x1"
    type: "BatchNorm"
    bottom: "conv1_1x1"
    top: "conv1_1x1"
    batch_norm_param {use_global_stats: true}
}
layer {
    name: "scale1_1x1"
    type: "Scale"
    bottom: "conv1_1x1"
    top: "conv1_1x1"
    param {lr_mult: 1.0}
    param {lr_mult: 2.0}
    scale_param {bias_term: true}
}
layer {
    name: "conv2_dw"
    type: "DepthwiseConvolution"
    bottom: "conv1_1x1"
    top: "conv2_dw"
    param {lr_mult: 1.0}
    param {lr_mult: 2.0}
    convolution_param {
      num_output: 48
      pad: 2
      kernel_size: 5
      group: 48
      stride: 4

    }
}
layer {
    name: "relu2_dw"
    type: "ReLU"
    bottom: "conv2_dw"
    top: "conv2_dw"
}
layer {
    name: "norm2_dw"
    type: "BatchNorm"
    bottom: "conv2_dw"
    top: "conv2_dw"
    batch_norm_param {use_global_stats: true}
}
layer {
    name: "scale2_dw"
    type: "Scale"
    bottom: "conv2_dw"
    top: "conv2_dw"
    param {lr_mult: 1.0}
    param {lr_mult: 2.0}
    scale_param {bias_term: true}
}
layer {
    name: "conv2_dw/neg"
    type: "Power"
    bottom: "conv2_dw"
    top: "conv2_dw/neg"
    power_param {
      power: 1
      scale: -1.0
      shift: 0
    }
}

layer {
    name: "conv2_dw/concat"
    type: "Concat"
    bottom: "conv2_dw"
    bottom: "conv2_dw/neg"
    top: "conv2_dw_cr"
}

layer {
    name: "shuffle"
    type: "ShuffleChannel"
    bottom: "conv2_dw_cr"
    top: "shuffle"
    shuffle_channel_param {
        group: 96
    }
}
layer {
    name: "conv2_1x1"
    type: "Convolution"
    bottom: "shuffle"
    top: "conv2_1x1"
    param {lr_mult: 1.0}
    param {lr_mult: 2.0}
    convolution_param {
      num_output: 256
      pad: 0
      kernel_size: 1
      stride: 1
      weight_filler {type: "msra"}
      bias_filler {type: "constant"}
    }
}
layer {
    name: "relu2_1x1"
    type: "ReLU"
    bottom: "conv2_1x1"
    top: "conv2_1x1"
}
layer {
    name: "norm2_1x1"
    type: "BatchNorm"
    bottom: "conv2_1x1"
    top: "conv2_1x1"
    batch_norm_param {use_global_stats: false}
}
layer {
    name: "scale2_1x1"
    type: "Scale"
    bottom: "conv2_1x1"
    top: "conv2_1x1"
    param {lr_mult: 1.0}
    param {lr_mult: 2.0}
    scale_param {bias_term: true}
}
#layer {
#    name: "pool2"
#    type: "Pooling"
#    bottom: "conv2_1x1"
#    top: "pool2"
#    pooling_param {
#      pool: MAX
#      kernel_size: 3
#      stride: 2
#      pad: 1
#    }
#}
layer {
	name: "conv3"
	type: "Convolution"
	bottom: "conv2_1x1"
	top: "conv3"
	param { lr_mult: 1.0 }
	param { lr_mult: 2.0 }
	convolution_param {
		num_output: 384
		kernel_size: 3
		pad: 1
		stride: 1
	}
}
layer {
	name: "relu3"
	type: "ReLU"
	bottom: "conv3"
	top: "conv3"
}
layer {
	name: "norm3_new"
	type: "BatchNorm"
	bottom: "conv3"
	top: "norm3"
    batch_norm_param {
       use_global_stats: true 
    }
}
layer {
	name: "scale3"
	type: "Scale"
	bottom: "norm3"
	top: "norm3"
    scale_param {
        bias_term: true 
    }
    param {
        lr_mult : 1.0  
        decay_mult: 0.0 
    }
    param {
        lr_mult : 2.0  
        decay_mult: 0.0 
    }
}
layer {
	name: "conv4"
	type: "Convolution"
	bottom: "norm3"
	top: "conv4"
	param { lr_mult: 1.0 }
	param { lr_mult: 2.0 }
	convolution_param {
		num_output: 384
		kernel_size: 3
		pad: 1
		stride: 1
	}
}
layer {
	name: "relu4"
	type: "ReLU"
	bottom: "conv4"
	top: "conv4"
}
layer {
	name: "norm4_new"
	type: "BatchNorm"
	bottom: "conv4"
	top: "norm4"
    batch_norm_param {
       use_global_stats: true 
    }
}
layer {
	name: "scale4"
	type: "Scale"
	bottom: "norm4"
	top: "norm4"
    scale_param {
        bias_term: true 
    }
    param {
        lr_mult : 1.0  
        decay_mult: 0.0 
    }
    param {
        lr_mult : 2.0  
        decay_mult: 0.0 
    }
}
layer {
	name: "conv5"
	type: "Convolution"
	bottom: "norm4"
	top: "conv5"
	param { lr_mult: 1.0 }
	param { lr_mult: 2.0 }
	convolution_param {
		num_output: 256
		kernel_size: 3
		pad: 1
		stride: 1
	}
}
layer {
	name: "relu5"
	type: "ReLU"
	bottom: "conv5"
	top: "conv5"
}

#========= RPN ============

layer {
  name: "rpn_conv/3x3"
  type: "Convolution"
  bottom: "norm4"
  top: "rpn/output"
  param { lr_mult: 1.0 decay_mult: 1.0 }
  param { lr_mult: 2.0 decay_mult: 0 }
  convolution_param {
    num_output: 512
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "rpn_relu/3x3"
  type: "ReLU"
  bottom: "rpn/output"
  top: "rpn/output"
}

layer {
  name: "rpn_cls_score"
  type: "Convolution"
  bottom: "rpn/output"
  top: "rpn_cls_score"
  param { lr_mult: 1.0 decay_mult: 1.0 }
  param { lr_mult: 2.0 decay_mult: 0 }
  convolution_param {
    num_output: 18   # 2(bg/fg) * 9(anchors)
    kernel_size: 1 pad: 0 stride: 1
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "rpn_bbox_pred"
  type: "Convolution"
  bottom: "rpn/output"
  top: "rpn_bbox_pred"
  param { lr_mult: 1.0 decay_mult: 1.0 }
  param { lr_mult: 2.0 decay_mult: 0 }
  convolution_param {
    num_output: 36   # 4 * 9(anchors)
    kernel_size: 1 pad: 0 stride: 1
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
   bottom: "rpn_cls_score"
   top: "rpn_cls_score_reshape"
   name: "rpn_cls_score_reshape"
   type: "Reshape"
   reshape_param { shape { dim: 0 dim: 2 dim: -1 dim: 0 } }
}

#========= RoI Proposal ============

layer {
  name: "rpn_cls_prob"
  type: "Softmax"
  bottom: "rpn_cls_score_reshape"
  top: "rpn_cls_prob"
}
layer {
  name: 'rpn_cls_prob_reshape'
  type: 'Reshape'
  bottom: 'rpn_cls_prob'
  top: 'rpn_cls_prob_reshape'
  reshape_param { shape { dim: 0 dim: 18 dim: -1 dim: 0 } }
}
layer {
       name: "proposal"
       type: "RPN"
       bottom: "rpn_cls_prob_reshape"
       bottom: "rpn_bbox_pred"
       bottom: "im_info"
       top: "rois"
       rpn_param {
           feat_stride : 16
           basesize : 16
           scale : 8
           scale : 16
           scale : 32
           ratio : 0.5
           ratio : 1.0
           ratio : 2.0
           boxminsize :16
           per_nms_topn : 6000;
           post_nms_topn : 300;
           nms_thresh : 0.7
       }
}

#----------------------new conv layer------------------
layer {
    bottom: "conv5"
    top: "conv_new_1"
    name: "conv_new_1"
    type: "Convolution"
    convolution_param {
        num_output: 1024
        kernel_size: 1
        pad: 0
        weight_filler {
            type: "gaussian"
            std: 0.01
        }
        bias_filler {
            type: "constant"
            value: 0
        }
    }
    param {
        lr_mult: 1.0
    }
    param {
        lr_mult: 2.0
    }
}

layer {
    bottom: "conv_new_1"
    top: "conv_new_1"
    name: "conv_new_1_relu"
    type: "ReLU"
}

layer {
    bottom: "conv_new_1"
    top: "rfcn_cls"
    name: "rfcn_cls_new"
    type: "Convolution"
    convolution_param {
        num_output: 245  #11*(7^2) cls_num*(score_maps_size^2)
        kernel_size: 1
        pad: 0
        weight_filler {
            type: "gaussian"
            std: 0.01
        }
        bias_filler {
            type: "constant"
            value: 0
        }
    }
    param {
        lr_mult: 1.0
    }
    param {
        lr_mult: 2.0
    }
}
layer {
    bottom: "conv_new_1"
    top: "rfcn_bbox"
    name: "rfcn_bbox"
    type: "Convolution"
    convolution_param {
        num_output: 392 #8*(7^2) cls_num*(score_maps_size^2)
        kernel_size: 1
        pad: 0
        weight_filler {
            type: "gaussian"
            std: 0.01
        }
        bias_filler {
            type: "constant"
            value: 0
        }
    }
    param {
        lr_mult: 1.0
    }
    param {
        lr_mult: 2.0
    }
}

#--------------position sensitive RoI pooling--------------
layer {
    bottom: "rfcn_cls"
    bottom: "rois"
    top: "psroipooled_cls_rois"
    name: "psroipooled_cls_rois"
    type: "PSROIPooling"
    psroi_pooling_param {
        spatial_scale: 0.0625
        output_dim: 5 
        group_size: 7
    }
}

layer {
    bottom: "psroipooled_cls_rois"
    top: "cls_score"
    name: "ave_cls_score_rois"
    type: "Pooling"
    pooling_param {
        pool: AVE
        kernel_size: 7
        stride: 7
    }
}


layer {
    bottom: "rfcn_bbox"
    bottom: "rois"
    top: "psroipooled_loc_rois"
    name: "psroipooled_loc_rois"
    type: "PSROIPooling"
    psroi_pooling_param {
        spatial_scale: 0.0625
        output_dim: 8
        group_size: 7
    }
}

layer {
    bottom: "psroipooled_loc_rois"
    top: "bbox_pred_pre"
    name: "ave_bbox_pred_rois"
    type: "Pooling"
    pooling_param {
        pool: AVE
        kernel_size: 7
        stride: 7
    }
}


#-----------------------output------------------------
layer {
   name: "cls_prob"
   type: "Softmax"
   bottom: "cls_score"
   top: "cls_prob_pre"
}

layer {
    name: "cls_prob_reshape"
    type: "Reshape"
    bottom: "cls_prob_pre"
    top: "cls_prob"
    reshape_param {
        shape {
            dim: -1
            dim: 5 
        }
    }
}

layer {
    name: "bbox_pred_reshape"
    type: "Reshape"
    bottom: "bbox_pred_pre"
    top: "bbox_pred"
    reshape_param {
        shape {
            dim: -1
            dim: 8  
        }
    }
}


